1. If warning message like '''DeprecationWarning: `should_run_async` will not call `transform_cell` automatically in the future.''' occurs, 
'''pip install --upgrade ipykernel''' will clear the case. Or, leave it alone, the program will still work.


2. Below is the model architecture and numbers of parameters in the case of input of a single-channel image with size 512*512.

It's a bit large to us, especially considering of training with a bigger epoch to get a higher accuracy on validation/testing set, 
and, unfortunately, we do not have a gpu (or multi-gpus) with certain corresponding performance to train and fine-tune it.
(We originally planned to train this model on a covid19-detection data set with each image in shape of 1*512*512.)

----------------------------------------------------------------------------
  Layer (type)       Input Shape          Output Shape         Param #    
============================================================================
   Conv2D-244     [[1, 1, 512, 512]]   [1, 64, 128, 128]        3,200     
   Reshape-16    [[1, 64, 128, 128]]     [1, 16384, 64]           0       
 LayerNorm-169     [[1, 16384, 64]]      [1, 16384, 64]          128      
 LayerNorm-171     [[1, 16384, 64]]      [1, 16384, 64]          128      
   Conv2D-245    [[1, 64, 128, 128]]   [1, 64, 128, 128]         640      
 BatchNorm-118   [[1, 64, 128, 128]]   [1, 64, 128, 128]         256      
   Conv2D-246    [[1, 64, 128, 128]]   [1, 64, 128, 128]        4,160     
DepSepConv2D-118 [[1, 64, 128, 128]]   [1, 64, 128, 128]          0       
   Conv2D-247    [[1, 64, 128, 128]]   [1, 64, 128, 128]         640      
 BatchNorm-119   [[1, 64, 128, 128]]   [1, 64, 128, 128]         256      
   Conv2D-248    [[1, 64, 128, 128]]   [1, 64, 128, 128]        4,160     
DepSepConv2D-119 [[1, 64, 128, 128]]   [1, 64, 128, 128]          0       
   Conv2D-249    [[1, 64, 128, 128]]   [1, 64, 128, 128]         640      
 BatchNorm-120   [[1, 64, 128, 128]]   [1, 64, 128, 128]         256      
   Conv2D-250    [[1, 64, 128, 128]]   [1, 64, 128, 128]        4,160     
DepSepConv2D-120 [[1, 64, 128, 128]]   [1, 64, 128, 128]          0       
   Identity-4      [[1, 16384, 64]]      [1, 16384, 64]           0       
   ConAtt-40       [[1, 16384, 64]]      [1, 16384, 64]           0       
 LayerNorm-170     [[1, 16384, 64]]      [1, 16384, 64]           0       
 LayerNorm-173     [[1, 16384, 64]]      [1, 16384, 64]          128      
   Linear-118      [[1, 16384, 64]]     [1, 16384, 256]        16,640     
    GELU-40       [[1, 16384, 256]]     [1, 16384, 256]           0       
  Dropout-118     [[1, 16384, 256]]     [1, 16384, 256]           0       
   Linear-119     [[1, 16384, 256]]      [1, 16384, 64]        16,448     
  Dropout-119      [[1, 16384, 64]]      [1, 16384, 64]           0       
 FeedForward-40    [[1, 16384, 64]]      [1, 16384, 64]           0       
 LayerNorm-172     [[1, 16384, 64]]      [1, 16384, 64]           0       
 Transformer-10    [[1, 16384, 64]]      [1, 16384, 64]           0       
   Reshape-17      [[1, 16384, 64]]    [1, 64, 128, 128]          0       
   Conv2D-251    [[1, 64, 128, 128]]    [1, 192, 64, 64]       110,784    
   Reshape-18     [[1, 192, 64, 64]]     [1, 4096, 192]           0       
 LayerNorm-174     [[1, 4096, 192]]      [1, 4096, 192]          384      
 LayerNorm-176     [[1, 4096, 192]]      [1, 4096, 192]          384      
   Conv2D-252     [[1, 192, 64, 64]]    [1, 192, 64, 64]        1,920     
 BatchNorm-121    [[1, 192, 64, 64]]    [1, 192, 64, 64]         768      
   Conv2D-253     [[1, 192, 64, 64]]    [1, 192, 64, 64]       37,056     
DepSepConv2D-121  [[1, 192, 64, 64]]    [1, 192, 64, 64]          0       
   Conv2D-254     [[1, 192, 64, 64]]    [1, 192, 64, 64]        1,920     
 BatchNorm-122    [[1, 192, 64, 64]]    [1, 192, 64, 64]         768      
   Conv2D-255     [[1, 192, 64, 64]]    [1, 192, 64, 64]       37,056     
DepSepConv2D-122  [[1, 192, 64, 64]]    [1, 192, 64, 64]          0       
   Conv2D-256     [[1, 192, 64, 64]]    [1, 192, 64, 64]        1,920     
 BatchNorm-123    [[1, 192, 64, 64]]    [1, 192, 64, 64]         768      
   Conv2D-257     [[1, 192, 64, 64]]    [1, 192, 64, 64]       37,056     
DepSepConv2D-123  [[1, 192, 64, 64]]    [1, 192, 64, 64]          0       
   Linear-120      [[1, 4096, 192]]      [1, 4096, 192]        37,056     
  Dropout-120      [[1, 4096, 192]]      [1, 4096, 192]           0       
   ConAtt-41       [[1, 4096, 192]]      [1, 4096, 192]           0       
 LayerNorm-175     [[1, 4096, 192]]      [1, 4096, 192]           0       
 LayerNorm-178     [[1, 4096, 192]]      [1, 4096, 192]          384      
   Linear-121      [[1, 4096, 192]]      [1, 4096, 768]        148,224    
    GELU-41        [[1, 4096, 768]]      [1, 4096, 768]           0       
  Dropout-121      [[1, 4096, 768]]      [1, 4096, 768]           0       
   Linear-122      [[1, 4096, 768]]      [1, 4096, 192]        147,648    
  Dropout-122      [[1, 4096, 192]]      [1, 4096, 192]           0       
 FeedForward-41    [[1, 4096, 192]]      [1, 4096, 192]           0       
 LayerNorm-177     [[1, 4096, 192]]      [1, 4096, 192]           0       
 LayerNorm-180     [[1, 4096, 192]]      [1, 4096, 192]          384      
   Conv2D-258     [[1, 192, 64, 64]]    [1, 192, 64, 64]        1,920     
 BatchNorm-124    [[1, 192, 64, 64]]    [1, 192, 64, 64]         768      
   Conv2D-259     [[1, 192, 64, 64]]    [1, 192, 64, 64]       37,056     
DepSepConv2D-124  [[1, 192, 64, 64]]    [1, 192, 64, 64]          0       
   Conv2D-260     [[1, 192, 64, 64]]    [1, 192, 64, 64]        1,920     
 BatchNorm-125    [[1, 192, 64, 64]]    [1, 192, 64, 64]         768      
   Conv2D-261     [[1, 192, 64, 64]]    [1, 192, 64, 64]       37,056     
DepSepConv2D-125  [[1, 192, 64, 64]]    [1, 192, 64, 64]          0       
   Conv2D-262     [[1, 192, 64, 64]]    [1, 192, 64, 64]        1,920     
 BatchNorm-126    [[1, 192, 64, 64]]    [1, 192, 64, 64]         768      
   Conv2D-263     [[1, 192, 64, 64]]    [1, 192, 64, 64]       37,056     
DepSepConv2D-126  [[1, 192, 64, 64]]    [1, 192, 64, 64]          0       
   Linear-123      [[1, 4096, 192]]      [1, 4096, 192]        37,056     
  Dropout-123      [[1, 4096, 192]]      [1, 4096, 192]           0       
   ConAtt-42       [[1, 4096, 192]]      [1, 4096, 192]           0       
 LayerNorm-179     [[1, 4096, 192]]      [1, 4096, 192]           0       
 LayerNorm-182     [[1, 4096, 192]]      [1, 4096, 192]          384      
   Linear-124      [[1, 4096, 192]]      [1, 4096, 768]        148,224    
    GELU-42        [[1, 4096, 768]]      [1, 4096, 768]           0       
  Dropout-124      [[1, 4096, 768]]      [1, 4096, 768]           0       
   Linear-125      [[1, 4096, 768]]      [1, 4096, 192]        147,648    
  Dropout-125      [[1, 4096, 192]]      [1, 4096, 192]           0       
 FeedForward-42    [[1, 4096, 192]]      [1, 4096, 192]           0       
 LayerNorm-181     [[1, 4096, 192]]      [1, 4096, 192]           0       
 Transformer-11    [[1, 4096, 192]]      [1, 4096, 192]           0       
   Reshape-19      [[1, 4096, 192]]     [1, 192, 64, 64]          0       
   Conv2D-264     [[1, 192, 64, 64]]    [1, 384, 32, 32]       663,936    
   Reshape-20     [[1, 384, 32, 32]]     [1, 1024, 384]           0       
 LayerNorm-183     [[1, 1024, 384]]      [1, 1024, 384]          768      
 LayerNorm-185     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-265     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-127    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-266     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-127  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-267     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-128    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-268     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-128  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-269     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-129    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-270     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-129  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-126      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-126      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-43       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-184     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-187     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-127      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-43       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-127     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-128     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-128      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-43    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-186     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-189     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-271     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-130    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-272     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-130  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-273     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-131    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-274     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-131  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-275     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-132    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-276     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-132  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-129      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-129      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-44       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-188     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-191     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-130      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-44       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-130     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-131     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-131      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-44    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-190     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-193     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-277     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-133    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-278     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-133  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-279     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-134    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-280     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-134  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-281     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-135    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-282     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-135  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-132      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-132      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-45       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-192     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-195     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-133      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-45       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-133     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-134     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-134      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-45    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-194     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-197     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-283     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-136    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-284     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-136  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-285     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-137    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-286     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-137  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-287     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-138    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-288     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-138  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-135      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-135      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-46       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-196     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-199     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-136      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-46       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-136     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-137     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-137      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-46    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-198     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-201     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-289     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-139    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-290     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-139  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-291     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-140    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-292     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-140  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-293     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-141    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-294     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-141  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-138      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-138      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-47       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-200     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-203     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-139      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-47       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-139     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-140     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-140      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-47    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-202     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-205     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-295     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-142    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-296     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-142  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-297     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-143    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-298     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-143  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-299     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-144    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-300     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-144  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-141      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-141      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-48       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-204     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-207     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-142      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-48       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-142     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-143     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-143      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-48    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-206     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-209     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-301     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-145    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-302     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-145  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-303     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-146    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-304     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-146  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-305     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-147    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-306     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-147  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-144      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-144      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-49       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-208     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-211     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-145      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-49       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-145     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-146     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-146      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-49    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-210     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-213     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-307     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-148    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-308     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-148  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-309     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-149    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-310     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-149  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-311     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-150    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-312     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-150  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-147      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-147      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-50       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-212     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-215     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-148      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-50       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-148     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-149     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-149      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-50    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-214     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-217     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-313     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-151    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-314     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-151  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-315     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-152    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-316     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-152  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-317     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-153    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-318     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-153  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-150      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-150      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-51       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-216     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-219     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-151      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-51       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-151     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-152     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-152      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-51    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-218     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-221     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Conv2D-319     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-154    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-320     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-154  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-321     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-155    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-322     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-155  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Conv2D-323     [[1, 384, 32, 32]]    [1, 384, 32, 32]        3,840     
 BatchNorm-156    [[1, 384, 32, 32]]    [1, 384, 32, 32]        1,536     
   Conv2D-324     [[1, 384, 32, 32]]    [1, 384, 32, 32]       147,840    
DepSepConv2D-156  [[1, 384, 32, 32]]    [1, 384, 32, 32]          0       
   Linear-153      [[1, 1025, 384]]      [1, 1025, 384]        147,840    
  Dropout-153      [[1, 1025, 384]]      [1, 1025, 384]           0       
   ConAtt-52       [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-220     [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-223     [[1, 1025, 384]]      [1, 1025, 384]          768      
   Linear-154      [[1, 1025, 384]]     [1, 1025, 1536]        591,360    
    GELU-52       [[1, 1025, 1536]]     [1, 1025, 1536]           0       
  Dropout-154     [[1, 1025, 1536]]     [1, 1025, 1536]           0       
   Linear-155     [[1, 1025, 1536]]      [1, 1025, 384]        590,208    
  Dropout-155      [[1, 1025, 384]]      [1, 1025, 384]           0       
 FeedForward-52    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-222     [[1, 1025, 384]]      [1, 1025, 384]           0       
 Transformer-12    [[1, 1025, 384]]      [1, 1025, 384]           0       
 LayerNorm-224        [[1, 384]]            [1, 384]             768      
   Linear-156         [[1, 384]]             [1, 4]             1,540     
============================================================================
Total params: 19,641,796
Trainable params: 19,590,340
Non-trainable params: 51,456
----------------------------------------------------------------------------
Input size (MB): 1.00
Forward/backward pass size (MB): 1774.65
Params size (MB): 74.93
Estimated Total Size (MB): 1850.58
----------------------------------------------------------------------------
